// ====== ข้อมูลนักศึกษา ======
// ประกาศตัวแปรเก็บข้อมูลนักศึกษา
const studentID = "68030125";           // รหัสนักศึกษา
const studentName = "ธีธัช คัคคนัมพร";  // ชื่อนักศึกษา
let midtermScore = 15;                  // คะแนนสอบกลางภาค
let finalScore = 18;                    // คะแนนสอบปลายภาค
const major = "คอมพิวเตอร์";             // สาขาวิชา
const gpa = 3.79;                       // เกรดเฉลี่ย

// Object สำหรับเก็บข้อมูลนักศึกษา
const student = {
    studentID: "68030125",              // รหัสนักศึกษา
    name: "ธีธัช คัคคนัมพร",             // ชื่อนักศึกษา
    major: "คอมพิวเตอร์",                // สาขาวิชา
    gpa: 3.79                           // เกรดเฉลี่ย
};
