function showTime(){
    let now = new Date();
    alert("เวลาปัจจุบัน: " + now.toLocaleTimeString());
}



// -----------------------------
// 1) ตัวแปรข้อมูลนักศึกษา
// -----------------------------

// ใช้ const เพราะข้อมูลประจำตัวไม่ควรเปลี่ยน
const studentID = "65012345";
const studentName = "วาวา";

// ใช้ let เพราะคะแนนอาจมีการแก้ไขภายหลังได้
let midtermScore = 28;
let finalScore = 35;


// -----------------------------
// 2) Object เก็บข้อมูลนักศึกษา
// -----------------------------

const student = {
    id: "65012345",          // รหัสนักศึกษา
    name: "วาวา",             // ชื่อ
    major: "เทคโนโลยีสารสนเทศ", // สาขา
    gpa: 3.75                 // เกรดเฉลี่ย
};


// -----------------------------
// ตัวอย่างการเรียกใช้งาน
// -----------------------------

console.log(studentName);     // แสดงชื่อ
console.log(student.gpa);     // แสดง GPA
